[1,["ecpdLyjvZBwrvm+cedCcQy","9bvaMerUlDyary99mJa6xp","a4zt2BDg1JsYLJP8vejspr","41D7kWhyFGY7q4NDlzkazn"],["node","_spriteFrame","_N$content","root","priNode","userNode","data"],[["cc.Widget",["_alignFlags","_top","_originalWidth","_left","_right","_originalHeight","_bottom","node"],-4,1],["cc.Node",["_name","_active","_objFlags","_components","_prefab","_contentSize","_parent","_children","_trs","_color","_anchorPoint"],0,9,4,5,1,2,7,5,5],["cc.Label",["_string","_fontSize","_N$horizontalAlign","_N$verticalAlign","_N$overflow","_N$cacheMode","_lineHeight","node","_materials"],-4,1,3],["cc.Sprite",["_sizeMode","_enabled","_type","node","_materials","_spriteFrame"],0,1,3,6],["cc.PrefabInfo",["fileId","root"],2,1],["cc.Prefab",["_name"],2],["cc.LabelOutline",["node"],3,1],["cc.Mask",["_N$alphaThreshold","node","_materials"],2,1,3],["cc.ScrollView",["horizontal","brake","bounceDuration","_N$horizontalScrollBar","_N$verticalScrollBar","node","_N$content"],-2,1,1],["cc.Button",["node","clickEvents"],3,1,9],["cc.ClickEvent",["_componentId","handler","target"],1,1],["0f6365LlyZFjK3X7k3XIJfh",["node","userNode","priNode"],3,1,1,1]],[[4,0,1,2],[0,0,2,7,3],[1,0,1,6,7,3,4,5,3],[1,0,6,3,4,9,5,8,2],[1,0,2,6,7,3,4,5,8,3],[1,0,2,6,7,3,4,5,10,8,3],[1,0,6,3,4,9,5,10,2],[2,0,1,2,3,7,8,5],[2,0,1,4,5,7,8,5],[0,0,2,5,7,4],[6,0,1],[7,0,1,2,2],[3,1,2,0,3,4,5,4],[8,0,1,2,3,4,5,6,6],[5,0,2],[1,0,7,3,4,5,8,2],[1,0,6,7,3,4,5,8,2],[1,0,1,6,3,4,9,5,3],[2,0,1,6,2,3,7,8,6],[0,0,3,1,7,4],[0,0,3,4,2,7,5],[0,0,1,6,2,5,7,6],[0,0,1,7,3],[0,0,3,4,1,6,2,5,7,8],[0,0,3,4,1,7,5],[0,0,7,2],[4,1,1],[3,3,4,5,1],[3,0,3,4,5,2],[9,0,1,1],[10,0,1,2,3],[11,0,1,2,1]],[[14,"agreeInfo"],[15,"agreeInfo",[-7,-8,-9],[[25,45,-2],[28,0,-3,[13],14],[31,-6,-5,-4]],[26,-1],[5,720,1600],[360,800,0,0,0,0,1,1,1,1]],[2,"userNode",false,1,[-14,-15],[[12,false,1,0,-10,[3],4],[13,false,0.75,0.23,null,null,-12,-11],[9,45,720,1100,-13]],[0,"cass1HZTVO57FTtHHZ44w5",1],[5,720,1600]],[2,"priNode",false,1,[-20,-21],[[12,false,1,0,-16,[8],9],[13,false,0.75,0.23,null,null,-18,-17],[9,45,720,1100,-19]],[0,"57N0RS4ExAapuZXtGAEc3e",1],[5,720,1600]],[16,"New Node",1,[-25],[[29,-22,[[30,"0f6365LlyZFjK3X7k3XIJfh","closeBtn",1]]],[24,9,40,1150.301,5,-23],[27,-24,[11],12]],[0,"2bLheuxLtMd7I0knXp4VLw",1],[5,90,94],[-279.5,752.7,0,0,0,0,1,0.9,0.9,0]],[4,"view",512,2,[-28],[[11,0,-26,[2]],[21,45,105,85,720,1100,-27]],[0,"dbMb+d915FsZKAXZrhM3Qr",1],[5,720,1410],[0,-10,0,0,0,0,1,1,1,1]],[5,"content",512,5,[-30],[[1,41,720,-29]],[0,"cd64Y6eoFOdaewyEvtDqTH",1],[5,720,29002],[0,0.5,1],[0,705,0,0,0,0,1,1,1,1]],[6,"New Label",6,[[8,"一、协议\n《游戏许可及服务协议》（以下简称“协议”）由您与本游戏服务提供者共同订立，本协议规定了适用于您使用我们任何游戏服务的具有法律约束力的条款和条件。为保障您的合法权益，请您在同意并接受本协议的全部条款前，仔细阅读并充分理解各条款的内容，特别是关于免责或限制本游戏服务者责任的条款（以下称“免责条款”）、对您的权利进行限制的条款（以下称“限制条款”）、任何用以激活或使用某项服务的单独的协议、约定争议解决方式和司法管辖的条款 。 系统将会以粗体形式提示您注意前述免除或限制责任等条款，请您在确认同意本协议之前或在使用游戏服务之前务必阅读前述条款。\n如果您未满 18 周岁，请与您的法定监护人一起阅读本协议，并特别注意未成年人的使用条款。\n 您声明并保证您有权利、权力和能力接受并遵守这些条款，并且您已充分阅读并理解这些条款，除非您已阅读并接受协议的所有条款，否则您无权使用游戏服务。 当您安装、使用、注册或以其他方式访问我们的服务，或单击同意隐私政策时，您应被视为已详细阅读并理解协议的所有内容，并同意遵守协议的规定。所以请您务必在点击操作前仔细、完整地阅读本协议。\n对于本协议的任何更改，将以弹窗的形式通知您，一经公布即有效替代原条款，不再另行通知用户。 如您不同意本服务条款的变更，您应停止使用或主动取消相关服务，否则您对相关服务的任何登录、查看等行为将视为您理解并接受本服务条款的变更和相关修改条款。 开发者和用户同意、理解并遵守以下条款，这些条款不仅适用于游戏服务，也适用于涉及开发者类似和相关情况的其他相关服务，并对其具有约束力。\n1.定义\n除非另有规定，本协议中下列术语的定义如下：\n1.1 本/本协议：指本协议的正文、游戏规则、隐私政策、未成年用户相关政策协议如用户指南和警告说明等，及上述文件修改版。 以上内容一经正式公布，即为本协议不可分割的一部分。\n1.2 游戏规则：指游戏服务提供者定期发布和修订的关于游戏的用户规则、玩家规则、游戏公告和通知。\n1.3 游戏服务提供者：本协议中也称“我们”，是指为您提供游戏及其服务的个人或公司。\n1.4 游戏：指游戏服务提供者运营的游戏的总称，包括电脑端游戏、网页游戏、手机游戏等形式的游戏； 游戏可能以软件的形式提供，在这种情况下，游戏还包括相关软件和相关文件。\n1.5 游戏服务：指为您提供的各类与游戏相关的网络运营服务，包括但不限于与游戏相关的社区服务。\n1.6游戏组件：请参阅与游戏中包含的内容和信息，例如文本，图片，音频，视频，图标，接口设计，布局框架，相关数据或电子文档。\n1.7您：也称为“玩家”或“用户”，是指有权使用提供的产品和服务的自然人。\n1.8游戏数据：指服务器在使用游戏期间记录的各种数据，包括但不限于游戏日志，安全日志等。\n1.9非法充值：指通过Apple App Store 支付频道以外的任何充值渠道进行中充值。\n1.10虚拟项目：包括但不限于游戏中的虚拟货币，物品，设备，材料等。\n1.11用户信息：涉及您在现实名称注册系统中注册的信息，游戏帐户中的游戏数据以及您在使用游戏服务期间提供的其他信息和数据，或者需要根据此类考虑来收集的信息作为安全性和用户经验优化。\n2.知识产权说明\n2.1 我们享有游戏本身及游戏组件（包括但不限于我们游戏中提供的UI设计、软件代码、文字、软件、声音、图片等所有元素）及所有相关的所有权知识产权，但第三方权利人依照法律规定或其他协议应享有的权利除外。未经游戏服务提供者事先书面同意，您不得以任何方式将游戏进行商业性使用。\n2.2 您在使用游戏服务时，有权删除设备下的游戏数据。但您在使用游戏服务中产生的账号数据信息、角色数据信息、等级、排行榜数据及虚拟物品数据信息等游戏数据的所有权和知识产权归我们所有，并由我们进行管理，我们有权在游戏内对玩家的游戏数据进行展示，有权对该游戏数据行使权力。\n2.3 本协议不应被视为向您许可或转让与游戏及游戏组件相关的任何权利或利益。\n2.4 您应按照本协议约定的方式使用游戏和游戏组件可能涉及的第三方享有的知识产权，该第三方对您基于本协议在游戏中使用该等知识产权有其他要求的，我们将以适当的方式向您告知该要求，您须一并遵守。因您违反本协议规定或您的其他单方面原因而侵犯任何第三方享有的知识产权的，由您自行承担并赔偿由此造成的损失。\n2.5我们尊重知识产权并且注重保护用户享有的各项权利。在游戏服务中，您可能需要通过上传、发布等各种方式向我们提供内容。在此情况下，您仍然享有此等内容的完整知识产权。您在此明确同意，我们及其关联公司有权在我们提供的游戏服务中使用、传播、复制、展示此等内容。\n2.6 我们首先向您提供的其他信息和内容。\n二、用户与服务\n1.关于“账号”\n1.1 游戏账号的获取\n(1) 如您需要使用和享受游戏及游戏服务，您必须完全同意本协议条款，遵守相关法律法规，并按照注册页面要求完成注册流程，包括但不包括仅限于输入正确的基本材料和信息。 一些地区用户承诺以真实身份进行注册，包括但不限于按照游戏要求及当地法律法规进行实名认证，并同意将填写的信息提交第三方机构进行验证，并保证资料和提供的信息真实、完整、有效。 用户对依据法律规定和本协议提供的信息承担相应的法律责任。。\n根据相关法律法规，我们有权要求您在使用游戏时提供您的真实身份信息和注册信息。根据相关法律法规，您有义务保证所提供信息的真实性、合法性、即时有效性和准确性，并有义务对所提供的所有信息承担法律责任。您理解并同意，如您不能履行上述义务，我们有权拒绝为您提供全部或部分服务，由此产生的不良后果和任何法律责任由您承担。\n(2) 如您拒绝按要求提供相应的材料和信息，或者提供的材料和信息不符合要求，我们有权拒绝提供相关服务或承担任何义务。如果您提供的资料和信息有任何变化，您应当及时更新，我们将及时提供服务。如因游戏账号信息发生变更但未及时修改而无法证明您的有效身份，我们有权拒绝提供任何信息或承担任何义务。\n(3) 您仅有权使用您创建的游戏帐号，包括退出和删除游戏帐号。但应视为您知悉并同意您对游戏体验或数据同步失败或游戏更新失败等造成的问题负责。\n(4) 您充分理解并同意，我们有权审核您注册时提供的身份信息是否真实有效，并有权通过技术和管理采取合理措施，确保您的游戏帐户的安全性和有效性。您的实名注册信息将按照相关要求在防沉迷系统中使用，即该信息可用于判断您是否年满18周岁，从而决定是否对您的游戏账号进行防沉迷限制。\n(5) 如您使用他人信息注册、登录我们的游戏或进行第三方支付，由此产生的一切法律责任由您承担。如果我们发现您使用的账户资料或账户信息属于他人所有，我们有权拒绝为您提供任何业务。如发现您的身份资料和信息被用于注册我们的游戏或未经您的合法授权使用，请及时与我们联系。\n我们保留自行决定删除、暂停或终止任何账户和/或通过我们认为因任何原因或在违反任何条款的情况下令人反感的任何账户和/或内容的访问权，恕不另行通知，不承担任何责任。\n1.2 用户账户的使用和保管\n(1) 您有义务妥善保管您的游戏账号及相关密码，正确、安全地使用您的游戏账号及密码。您根据本协议注册的游戏账号仅用于您的个人娱乐或消费目的。您对您所持有的游戏账号登录后的行为依法享有权利和义务。您不得将游戏账号与第三方共享，不得将游戏账号转让给他人，不得要求进行游戏升级等. 如果您未能妥善保管您的账号和密码，或者未能正确、安全地使用您的账号和密码，因您的账号和密码丢失或被盗以及侵犯您和他人的民事权利而引起的任何法律责任由您承担。\n(2) 您在得知您的帐号或密码被非法使用、被盗或出现异常情况时，应立即通知我们，并有权通知我们采取措施暂停该游戏帐号的登录和使用。\n(3) 如我们根据您的通知需要采取措施暂停您的用户帐户的登录和使用，我们有权要求您提供并验证与您注册的身份信息相同的有效个人身份证明。如果证明您提供的有效个人身份证明与注册的身份信息一致，我们将及时采取措施暂停用户账号的登录和使用。如您未提供个人有效身份证明或您提供的有效个人身份证明与注册的身份信息不一致，我们有权拒绝您暂停游戏账号登录和使用的请求，因此造成的损失将由您自行承担。\n(4) 您应充分理解并同意，为提高游戏服务的安全级别，我们有权将相关技术或软件应用到游戏中，但我们不保证这些安全保障措施能够完全防止游戏帐户被盗或丢失的风险。\n(5) 您应充分理解并同意，如果您的游戏帐号的使用根据相关业务规则受到限制、冻结或终止，可能导致您游戏帐号下的游戏数据及相关信息被删除，由此产生的相关权益由您自己承担，我们对此不承担任何责任。\n(6) 您应充分理解并同意我们通过短信或其他方式向您发送产品促销、游戏服务或其他相关业务信息。如果您想停止接收推送消息，可以通过官网公布的联系方式联系我们告知取消请求，开发者验证后取消推送。\n(7) 您应充分理解并同意，为有效使用服务器资源，我们有权在必要时，在您未使用的情况下，提前通知、删除或处置游戏账号及相关游戏数据和信息。一个游戏账号可以长时间登录游戏。上述处置可能导致游戏账号下相关权益的损失，我们对此不承担任何责任。\n(8) 如您提供与注册身份信息一致的有效个人身份信息，以维护您的合法权益，我们同意根据您的要求为您提供包括账号注册人证明、原始注册信息等在内的协助和支持，并根据需要向有关部门提供有关证据和材料。\n2.用户信息\n2.1 您同意并授权收集和使用您的用户信息以履行本协议。 对您的用户信息中包含的个人信息的收集、使用、共享、存储和管理将遵守统一发布的隐私政策和相关法律法规。\n2.2 您充分理解并同意，如您在使用游戏服务过程中向他人泄露您的财产账户、银行卡、信用卡及相应的密码等重要数据和信息，由此造成的任何损失由您自行承担。\n3.游戏和游戏服务\n3.1 您只能通过以下方式将游戏和游戏服务用于非商业目的：\n(1) 接收、下载、安装、启动、升级、登录、显示、运行和/或截屏游戏；\n(2) 创建游戏角色、设置网名、查看游戏规则、用户个人信息、游戏比赛结果、设置游戏参数、使用聊天功能和社交分享功能、通过游戏中的合法渠道购买、使用、赠送虚拟物品， 等等;\n(3) 使用游戏支持和允许的一项或多项其他功能。\n您进行任何其他形式的未经授权的安装、使用、访问、展示、操作和转让将被视为违反本协议。\n3.2 未经许可，您不得以任何方式记录和传播游戏内容给他人，包括使用任何第三方软件进行网络传播。\n3.3 对于提供的软件，您在使用游戏和服务时还应遵守本协议关于软件下载和安装的规定。\n3.4 如果我们发现或收到他人举报或投诉您违反本协议，我们有权随时删除相关内容，恕不另行通知，并视行为实施处罚，包括但不限于警告、限制或禁止使用全部或部分功能，禁止甚至注销游戏账号，结果将另行通知。\n3.5 您充分理解并同意，我们有权基于合理判断对违反相关法律法规或本协议规定的行为进行处罚，对任何违反法律法规的用户采取适当的法律行动，并将相关信息保存证据。由此产生的一切法律责任由用户承担。\n3.6 您应充分理解并同意，因您违反本协议或相关服务条款的规定而导致第三方提出的任何索赔、要求或损失由您单独承担，由此造成的任何损失由您自行承担。游戏服务提供者相应遭受损失的，有权要求您承担赔偿责任。\n3.7 您应充分理解并同意，虚拟物品是游戏服务的一部分，特此允许您根据本协议获得使用权。您购买和使用虚拟物品应符合本协议的要求和游戏的具体规则；同时，虚拟物品可能会受到一定有效期的限制。如您未在规定的有效期内使用，除不可抗力或可归责原因外，有效期届满即自动失效。\n3.8 您应充分理解并同意，为营造公平、健康的游戏环境，我们有权在您使用游戏服务过程中通过技术手段了解您的相关终端设备信息。一旦发现任何危害游戏服务正常运行的未经授权的程序，将收集所有相关信息并采取合理措施。\n3.9 您应充分理解并同意，您在使用游戏收费功能时，应按要求支付相应费用。而且，这些权利属于商业自主权，也就是说我们保留随时改变商业模式的权利，即改变收费标准、收费软件功能、收费对象和收费时间的权利。同时，我们也保留升级、修改、添加、删除、修改、更改游戏功能或规则的权利。如果您不接受此类更改，您应立即停止使用该应用程序；您继续使用本应用程序即视为您接受变更后的商业模式。\n3.10 您应充分理解并同意，为保证您和其他用户的游戏速度，我们有权定期转移或清除游戏服务器上存储的部分过往游戏数据。\n3.11 您应充分理解并同意，您使用的游戏服务涉及互联网服务，可能受互联网各方面不稳定因素的影响。因此，本游戏服务存在因不可抗力、病毒或黑客攻击、系统不稳定、用户定位、用户关机等任何技术、互联网、通讯线路等原因导致服务中断或无法满足用户要求的风险。\n鉴于此，在适用法律允许的最大范围内，我们不保证所提供的游戏服务一定能满足您的要求，也不保证所提供的游戏服务不会中断，也不保证游戏服务的及时性和安全性，错误的发生以及信息能否准确、及时、顺畅地传递将不予保证。\n3.12 您应充分理解并同意，在使用游戏服务时，存在来自他人的威胁、诽谤、冒犯或非法内容或行为或侵犯他人权利（包括知识产权）的匿名或虚假信息风险，以上风险由您承担。我们不对游戏服务做任何明示或暗示的保证，包括关于真实性、适销性、特定用途的适用性、所有权和不侵权的默示保证和条件的所有相关信息。对于因您不当或非法使用本服务而造成的任何直接、间接、偶然、特殊及后续的损害，我们不承担任何责任。\n3.13 您应充分理解并关注以下内容：\n(1) 应用程序可能会通过发布软件升级包或软件补丁、在线升级等方式进行定期更新。在更新过程中，可能会检索和收集您的游戏客户端软件版本等个人信息，并将被自动替换、修改、删除和/或补充。这种行为是软件更新的必要操作或步骤。如果您不同意此类操作，请不要更新；您使用更新即视为您同意此类操作。\n(2) 对于游戏，部分更新是指软件版本的更新。如果您不执行此类更新，您将无法登录应用程序。而且，这种更新会导致您使用的终端上的原始软件版本被新的软件版本完全替换。\n(3) 因用户违反本协议或法律法规的行为而采取的措施可能导致您当前游戏账号下的虚拟物品失效，其使用寿命在采取某些措施的期限内，损失的由此产生的后果由您承担。即上述措施的持续时间计入虚拟物品的使用寿命；而这些措施终止实施后，虚拟物品的使用寿命将不会相应恢复。\n3.14 游戏规则、BUG（又称漏洞、缺陷等）或外挂投诉、游戏道具找回、游戏道具锁定或解锁、账号申诉等客户服务说明可通过官方提供应用程序网站、客服电话、游戏管理员或其他渠道，应具备以下条件：\n(1) 您已通过官方客服网站或提供的其他渠道了解这些客户服务的内容、要求和资费，谨慎选择是否需要享受相应的客户服务，真实、准确地表达了您的需求。\n(2) 您已同意并接受有关该等客户服务的特别协议或条款。\n(3) 您已按照客服要求如实提供了您的相关注册账号信息和游戏情况，以及您所知道的其他用户或网络游戏本身的情况，例如您的账号和相关资料、网游登录状态及游戏道具情况、应用程序中的BUG（又称漏洞、缺陷等）、插件等您发现的玩家使用过的BUG（又称漏洞、缺陷等）或插件。\n3.15 我们有权停止或中断游戏服务器提供的服务，当出现下列情形之一时，给用户或第三方造成的任何不便或损害，我们不承担任何责任：\n（1）定期检查或施工、软硬件更新等。我们有权暂停服务，但会尽快完成维护和更新工作；\n（2）服务器损坏，无法正常运行；\n（3）软硬件设备和电子通讯设备的突发故障；\n（4）网络供应商线路故障或其他原因；\n（5）在紧急情况下维护国家安全或者其他用户、第三方的人身安全；\n（6） 不可抗力等第三方原因。\n3.16根据相关法律法规和本协议的规定，我们将采取有效措施保护未成年人在使用游戏服务过程中的合法权益，包括可能采取的技术措施，禁止未成年人接触不当游戏或游戏功能，限制未成年人的游戏时间，防止未成年人沉迷网络。\n4.用户行为\n4.1 您应充分理解并同意，您必须对您在游戏账号下的一切行为负责，包括您发布的任何内容以及由此产生的任何后果。您应自行判断游戏内容，并承担因使用游戏服务而产生的一切风险，包括因依赖游戏内容的正确性、完整性或实用性而产生的风险。本游戏不能也不会对因上述风险造成的任何损失或损害承担责任。\n4.2 除按照本协议规定使用游戏服务外，您不得从事任何侵犯游戏及游戏组件相关知识产权的行为，或进行其他损害第三方合法权益的行为。\n4.3 除非相关法律允许或书面许可，您在使用游戏服务时不得进行包括但不限于以下行为：\n(1) 删除游戏及其他副本上的所有版权信息和内容；\n(2) 对软件进行逆向工程、逆向编译、逆向解码或试图寻找源代码，并将该源代码使用或泄露给任何第三方；\n(3)对游戏软件进行扫描、探测、测试，以检测、发现、搜索可能存在的BUG（也称为漏洞、缺陷等）或弱点；\n(4) 复制、修改、添加、删除、挂接或创建游戏软件终端内存或游戏软件运行过程中释放的数据、运行过程中客户端与服务器的交互数据的任何衍生作品软件，以及软件运行所需的系统数据，包括但不限于使用未经合法授权访问软件及相关系统的插件、插件或第三方工具/服务;\n(5) 修改或伪造软件运行中的指令和数据；增加、删除、改变软件的功能或运行效果；或向公众运营或传播用于上述目的的软件和方法，无论上述行为是否出于商业目的；\n(6) 通过非开发、未经授权的第三方软件、插件、插件、系统使用游戏及游戏服务，或制作、发布、传播非开发、未经授权的第三方软件、插件、 ins、插件和系统；\n(7)在游戏中使用、出租、出借、复制、修改、链接、转载、编译、发布、发布、建立镜像站点或截取游戏中具有知识产权的内容的网页（网络）快照；或通过设置服务器向他人提供与游戏服务相同或相似的服务；\n(8) 将游戏的任何部分分开单独使用，或用于其他不符合本协议的目的；\n(9) 以不符合本协议规定的方式使用游戏名称、商标或其他知识产权；\n(10)其他未经明确授权的行为。\n4.4 如果您在使用游戏服务过程中出现以下行为，您将被暂时或永久禁止登录，并删除您的游戏账号和游戏数据及相关信息，视情节轻重，按照符合本协议规定及相关游戏规则。情节严重的，将追究法律责任：\n(1)  利用游戏及服务发布、传播、传播、储存危害任何国家安全、社会稳定的内容，或侮辱诽谤、色情、暴力、引起骚乱、违反社会秩序的内容道德，以及任何违反法律、法规和政策的内容；或者设置包含以上内容的网名、角色名等。\n(2) 利用游戏及服务发布、传播、传播、储存侵犯他人知识产权、商业秘密权、肖像权、隐私权等合法权利的内容。\n(3) 进行任何危害网络安全的行为，包括但不限于：使用未经授权的数据或访问未经授权的服务器/账户；未经许可访问公共网络或他人终端系统，删除、修改、添加存储信息；未经授权尝试检测、扫描和测试“软件”系统或网络的弱点或其他破坏网络安全的行为；企图干扰、破坏“软件”系统或网站的正常运行，故意传播恶意程序或病毒；其他干扰、干扰正常网络信息服务的行为；并伪造（部分）数据包的名称。\n(4) 进行主动或被动计分、合作作弊、使用外挂或其他作弊软件、利用BUG（也称为“漏洞”或“缺陷”等）获取不正当、非法利益，或通过互联网等方式向社会公开插件、作弊软件或BUG。\n(5) 利用游戏进行任何商业活动，如广告、销售产品，或任何违反利益的非法行为，如出售游戏账号、出售游戏中的虚拟物品或信息、非法充值、雇佣他人提供信息等。一经发现，我们有权暂停用户账号，有权根据造成的影响程度确定暂停的时限，并有权恢复和删除您所有异常获取的数据。\n(6) 冒充游戏服务管理员或游戏论坛管理员、版主发布任何欺诈或虚假信息。\n(7) 各种非法外挂行为。\n(8) 盗取他人游戏账号和游戏道具的。\n(9) 私下进行游戏账号交易，私下进行游戏道具、游戏装备、游戏币等交易。\n(10) 利用网络游戏系统可能存在的技术缺陷或者漏洞，以各种形式为自己和他人谋取利益。\n(11) 利用游戏中提供和存储的各种付费或免费游戏过程中产生的全部或部分数据和信息，以各种形式为自己和他人谋取利益。\n(12) 公开外挂、私服、代练、换币、木马等内容，或公开传播上述内容。\n(13) 未经授权使用所提供的产品和服务在现实中牟利，以及其他业内普遍认可的不当行为，无论是否已在本协议中明确列出。\n4.5 除本协议规定的使用方式外，未经许可，您不得进行以下任何行为，如需执行，请与我们联系并应要求与我们签订电子或纸质协议：\n(1) 修改、复制、分发、出租、出版、翻译、编译、改编和/或复制游戏或其各种衍生作品，或通过互联网或其他方式公开。\n(2) 游戏改编衍生品的制作、批发、销售、出版和/或发行。\n(3) 提供测试、BUG（也称“漏洞”或“缺陷”等）及外挂跟踪报告、广告文章撰写与推广、游戏竞争情报收集等服务。\n(4) 使用游戏名称、商标等。\n(5) 进行除上述需要开发者同意的行为以外的其他与游戏服务相关的行为。\n4.6 如用户违反本协议或相关法律法规，我们有权采取以下一项或多项措施：\n(1) 立即断开当前使用的终端与应用服务器的网络连接，必须重新登录才能继续使用应用。\n(2) 暂时禁止您使用您当前使用的账号登录网络游戏。\n(3) 暂时禁止您使用应用程序的某项需要付费的功能，直至您支付所欠费用之日为止，并为继续使用上述付费功能而提前支付相应费用。\n(4) 减少或清除您当前在应用程序中使用的帐户的积分、等级和/或荣誉。\n(5) 暂时禁止您以您当前使用的账号在网络游戏中发表任何评论。\n(6) 永久、不可撤销地删除您发布的广告、虚假信息或非法言论，或采取其他措施阻止其传播。\n(7) 永久、不可撤销地删除您非法获得的虚拟货币、游戏道具和/或游戏装备等游戏道具，或将其退还给其他通过合法方式获得使用权的用户。\n(8) 永久且不可撤销地取消或清除您非法获得的积分、成绩和/或荣誉。\n(9) 永久且不可撤销地禁止您使用您当前使用的帐户在应用程序中发表任何评论。\n(10) 永久且不可撤销地删除您当前账号下的所有游戏道具、游戏装备、游戏币、积分、等级、荣誉等信息和相应的游戏数据。\n(11) 永久且不可撤销地禁止您使用您当前使用的账号登录应用程序，并删除和清除该账号在应用程序中产生的所有数据、游戏币、物品、装备等信息。\n(12) 采取上述以外的措施。\n我们可以连续地、间歇地或交替地采取一种或多种前述措施。\n如果同一用户有任何违反本协议及其他相关规定的账号或角色，我们有权对该用户下的所有账号和角色进行制裁，包括但不限于暂停、终止、删除该用户下的所有账号、用户。\n5.软件下载与安装\n5.1 使用游戏服务可能需要下载安装相关软件。您可以直接从相关网站或授权第三方获取该软件。如果您从未经授权的第三方获取游戏或同名游戏，将视为您未获得授权，不保证该游戏可以正常使用，我们不承担任何责任从而造成的损失。\n5.2 可能针对不同的终端设备或操作系统开发不同的软件版本。您应根据实际情况选择下载合适的版本，安装下载程序后，请按照程序提示的步骤正确安装。\n5.3 不提供其他游戏及安全服务。在软件安装过程中，可能会推荐您安装其他软件，您可以选择安装或不安装。\n5.4 如果您不再需要使用本软件或需要安装新版本，您可以自行卸载。如果您愿意帮助改进产品和服务，请告知卸载原因。\n5.5 为保证游戏服务的安全性和功能的一致性，我们有权在不特别通知您的情况下对软件进行更新，或对软件的部分功能效果进行更改或限制。\n5.6 新版软件发布后，旧版软件可能无法使用，不保证旧版软件及相应客服继续可用。请随时查看并下载最新版本。\n三、未成年人使用条款\n1.若用户是未满18周岁的未成年人，应在监护人监护、指导并获得监护人同意情况下认真阅读本协议后，方可使用本游戏软件及相关服务。\n2. 未成年用户理解如因您违反法律法规、本协议内容，则您及您的监护人应依照法律规定承担因此而可能引起的全部法律责任。\n3.未成年人用户特别提示：如果您未满18周岁的，为保障您的合法权益，我们有权依据相关地区有关法律法规及相关政策规定及本协议，约定采取以下一种或多种措施：\n（1）将与您游戏相关的信息（包括但不限于您游戏账号的登录信息等）提供给您的法定监护人，使得您法定监护人可及时或同步了解您游戏情况；\n（2）采取技术措施屏蔽某些游戏或游戏的某些功能，或限定您游戏时间或游戏时长；\n（3）注销或删除您游戏账号及游戏数据等相关信息；\n（4）您法定监护人要求采取的，或我们认为可采取的其他合理措施，以限制或禁止您使用本游戏。\n4.作为游戏规则的一部分，用户指南和警告说明也会在适当的地方发布，包括游戏内容介绍、正确使用游戏的方法等。所有未成年用户应在其法定监护人的指导下仔细阅读并遵守这些指南和说明；其他玩家在使用游戏服务时，应避免发布或产生任何损害未成年人身心健康的内容，共同营造健康的游戏环境。\n \n四、免责声明\n1. 游戏及游戏服务以提供给您的实际情况及版本为准。我们不保证游戏和游戏服务不会出错和不间断；所有缺陷均已得到纠正；或游戏和游戏服务不会受到病毒或任何其他因素的破坏。除非法律另有规定，我们在此明确否认任何明示或暗示的保证责任，包括但不限于对游戏和游戏服务的性能、适用性或不侵权的保证。\n2. 在任何情况下，因不可抗力造成您在使用游戏及游戏服务过程中遭受的任何损失，我们概不负责。此类不可抗力事件包括但不限于国家法律、法规、政策、国家机关命令，或其他不可预测、不可避免、无法克服的事件，如地震、火灾、雪灾、火灾、海啸、台风、罢工、战争，等等。\n3. 我们将根据已证明或掌握的资料或信息，随时独立决定更改、终止或暂停您对任何游戏和游戏服务的使用，而无需事先通知您，但根据相关法律法规、本协议或您的协议的规定需要提前通知的情况除外。如您的行为违反相关法律法规或本协议的规定，我们将按照相关规定终止或暂停您对任何游戏及游戏服务的使用，我们不承担任何责任并有权要求您承担相应的责任。\n4. 您的游戏角色、游戏道具、游戏装备、游戏币的账号数据可能因游戏软件BUG（又称漏洞、缺陷等）、版本更新缺陷、第三方病毒攻击、网络连接或任何其他因素。在发现数据异常原因之前，我们有权暂时冻结游戏账号；若发现数据异常为游戏异常行为，我们有权将游戏账号数据恢复至异常前的原始状态（包括从第三方恢复），我们不对您承担任何责任。\n5. 您无权通过购买、接受赠品等方式从任何第三方获取游戏账号、游戏道具、游戏装备、游戏币等，我们对第三方交易不承担任何责任，不接受因第三方交易引起的争议而提出的任何上诉。\n6. 您应充分理解第三方在游戏中投放的广告、链接或其他形式的宣传内容，其真实性由您自行判断。我们不会对其宣传内容做出任何明示或暗示的保证。对于您通过本网站或链接网站购买的服务或商品，交易行为仅存在于您与商品或服务的提供者之间，与我们无关。我们不承担您与商品或服务提供者之间由此产生的任何法律责任。您同意并理解，如您在游戏中使用第三方支付，您应仔细阅读并接受第三方隐私政策和用户协议，并接受第三方支付对账户、网络环境等的风险评估。如果您认为这些操作对您有害，请谨慎应用。如您坚持使用，您应知晓并承担由此造成的一切后果。\n7. 您应充分理解不同操作系统之间存在不可互通的客观情况，该客观情况并非由我们造成，可能导致您在一个操作系统中的充值和游戏数据无法顺利转移到另一个操作系统。 您在不同系统之间切换造成的充值丢失和游戏数据丢失的风险由您自行承担，我们不承担任何责任。\n8. 您应充分理解游戏中可能存在强制战斗区域或玩法。如果您不同意强制战斗，请不要进入游戏或游戏区域。您的参赛作品将被视为您同意该游戏并接受相应的后果。\n五、信息收集与保护\n您同意并授权收集和使用您的用户信息以履行本协议。通过使用我们的服务，您确认您已阅读并同意我们的以下活动：\na) 收集有关您如何使用我们的服务的信息（例如您安装我们的服务的时间、您使用的我们的服务版本、您如何使用您可以使用的各种功能和特性）、有关您的信息的信息移动设备（例如操作系统、硬件版本、设备设置、设备标识符）和您的通信；\nb) 出于以下目的处理您的信息：(i) 管理和维护作为我们服务一部分的功能和特性； (ii) 分析、开发和改进我们的服务并开发新产品和服务； (iii) 检测和防止滥用、欺诈、恶意或潜在非法活动，并保护我们用户的权利、安全或财产；(iv) 执行收集时可能向您描述的其他功能或 您就我们的服务启用的；\nc) 在多个国家/地区存储和传输您的信息；\nd) 在任何情况下公开披露您的帐户 ID、个人资料图片和与您在服务中的角色相关的其他详细信息。\n对您的用户信息中包含的个人信息的收集、使用、共享、存储和管理将遵守统一发布的隐私政策和相关法律法规。\n我们将采取合理措施保护用户的个人隐私信息。 除非本协议另有约定，游戏服务将遵循统一发布的隐私政策。\n六、执法\n1.法律监督\n1.1 您在使用游戏服务时，应遵守当地相关法律法规，尊重当地道德风尚。 如果您的行为违反当地法律、法规或道德风俗，您应独立为此承担全部责任。\n1.2 您应避免因使用游戏服务而卷入政治和公共事件，否则我们有权暂停或终止您的服务。\n2.管辖法院及法律\n2.1本协议适用游戏服务提供者所在地法律法规（不包括冲突法），不考虑任何冲突法规定。\n2.2如发生因履行本协议或与本协议有关的争议，双方应首先友好协商解决。 如果谈判失败，您与游戏服务提供者同意，与本协议有关的一切事项，包括一切争议，均受游戏服务提供者法院地管辖。\n2.3本协议中所有条款的标题仅为阅读方便，并无实际意义，不能作为解释本协议含义的依据。\n2.4 本协议条款因任何原因部分无效的，其余条款仍有效，对各方均有约束力。\n七、其他\n1.本协议是您与我们之间就我们的服务达成的完整协议。您同意，您不会就协议中未明确规定的任何声明向我们提出索赔。本协议任何规定（或任何规定的部分）的无效性不会影响任何其他规定（或该规定的其余部分）的有效性或可执行性。如果法院认为我们无法执行草拟的条款的任何部分，我们可以在适用法律下可强制执行的范围内用类似条款替换这些条款，而不更改协议的其余条款。执行本协议任何规定的任何延迟均不得解释为放弃该规定下的任何权利。本协议项下的任何权利和义务按其性质应继续有效，包括但不限于与各方的责任或赔偿（如有）有关的任何义务，在本协议终止或期满后仍然有效。\n2.根据一些地区的法律法规，我们提醒您：抵制不良游戏，拒绝盗版游戏；注意自我保护，谨防上当受骗；适度的游戏有益于你的大脑，沉迷于游戏会伤害你的身体。\n3.如果您有针对游戏服务的任何问题、投诉或要求需要联系我们，请访问官方网站或者发送邮件至客服邮箱。\n\n客服邮箱：2275148893@qq.com",30,3,2,-31,[1]],[10,-32],[20,41,60,60,720,-33]],[0,"23qgIxreVGWqhMRRm3G62b",1],[4,4278190080],[5,600,29002],[0,0.5,1]],[4,"view",512,3,[-36],[[11,0,-34,[7]],[23,45,60,60,105,85,720,1100,-35]],[0,"9d7FFHh/VCoYzDJQ4i+7el",1],[5,600,1410],[0,-10,0,0,0,0,1,1,1,1]],[5,"content",512,8,[-38],[[1,41,720,-37]],[0,"4doCQRO2pMnZGmBTpHvX1f",1],[5,600,1802],[0,0.5,1],[0,705,0,0,0,0,1,1,1,1]],[6,"New Label",9,[[8,"本指引是上海芃檀科技有限公司（以下简称“开发者”）为处理你的个人信息而制定。\n1. 开发者处理的信息\n根据法律规定，开发者仅处理实现《麻雀消除》小游戏功能所必要的信息。不会收集您的其他个人隐私信息。\n\n2. 你的权益\n关于你的个人信息，你可以通过以下方式与开发者联系，行使查阅、复制、更正、删除等法定权利。\n邮箱: 2275148893@qq.com\n\n3. 开发者对信息的存储\n开发者承诺，除法律法规另有规定外，开发者对你的信息的保存期限应当为实现处理目的所必要的最短时间。\n\n4. 信息的使用规则\n开发者将会在本指引所明示的用途内使用收集的信息。\n如开发者使用你的信息超出本指引目的或合理范围，开发者必须在变更使用目的或范围前，再次以小游戏弹窗方式告知并征得你的明示同意。\n\n5. 信息对外提供\n开发者承诺，不会主动共享或转让你的信息至任何第三方，如存在确需共享或转让时，开发者应当直接征得或确认第三方征得你的单独同意。\n开发者承诺，不会对外公开披露你的信息，如必须公开披露时，开发者应当向你告知公开披露的目的、披露信息的类型及可能涉及的信息，并征得你的单独同意。\n\n6. 若你认为开发者未遵守上述约定，或有其他的投诉建议、或未成年人个人信息保护相关问题，可通过以下方式与开发者联系。\n公司地址：上海市嘉定区江桥镇沙河路337号1_203室JT5117\n公司邮箱: 2275148893@qq.com\n\n更新日期：2025-2-12\n生效日期：2025-2-12",30,3,2,-39,[6]],[10,-40],[1,41,720,-41]],[0,"f4S6mymfdKS46M4dvyJPhO",1],[4,4278190080],[5,600,1802],[0,0.5,1]],[3,"New Label",2,[[7,"《用户协议》",35,1,1,-42,[0]],[19,17,375,26.799999999999955,-43]],[0,"b8xXDLye1LWo8pb20WmQQ0",1],[4,4278190080],[5,210,50.4],[0,748,0,0,0,0,1,1,1,1]],[3,"New Label",3,[[7,"《隐私政策》",35,1,1,-44,[5]],[22,17,22.799999999999955,-45]],[0,"bc4fGtGSFKLafvCZ2ykd0V",1],[4,4278190080],[5,210,50.4],[0,752,0,0,0,0,1,1,1,1]],[17,"New Label",false,4,[[18,"返回",30,60,1,1,-46,[10]]],[0,"76tmhmH6BF0YrfQVS4BIEa",1],[4,4278190080],[5,60,75.6]]],0,[0,3,1,0,0,1,0,0,1,0,4,3,0,5,2,0,0,1,0,-1,2,0,-2,3,0,-3,4,0,0,2,0,2,6,0,0,2,0,0,2,0,-1,11,0,-2,5,0,0,3,0,2,9,0,0,3,0,0,3,0,-1,12,0,-2,8,0,0,4,0,0,4,0,0,4,0,-1,13,0,0,5,0,0,5,0,-1,6,0,0,6,0,-1,7,0,0,7,0,0,7,0,0,7,0,0,8,0,0,8,0,-1,9,0,0,9,0,-1,10,0,0,10,0,0,10,0,0,10,0,0,11,0,0,11,0,0,12,0,0,12,0,0,13,0,6,1,46],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],[-1,-1,-1,-1,1,-1,-1,-1,-1,1,-1,-1,1,-1,1],[0,0,0,0,1,0,0,0,0,1,0,0,2,0,3]]